#словник, автор Кондратенко Р. ППМР1-104
students = {
    "Andrii Andrienko": {
        'Навчальна група': "КН-42",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон", "Математичні методи дослідження операцій"],
        'Бали за семестр': [90, 95, 98, 85]
    },
    "Igor Igorovych": {
        'Навчальна група': "КН-41",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон", "Математичні методи дослідження операцій"],
        'Бали за семестр': [80, 90, 85, 97]
    },
    "Anna Anenko": {
        'Навчальна група': "КН-42",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [79, 91, 83, 97]
    },
    "Egor Egorovych": {
        'Навчальна група': "КН-43",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [82, 87, 81, 100]
    },
    "Viktoria Viktorivna": {
        'Навчальна група': "КН-45",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [97, 98, 96, 94]
    },
    "Arsen Arsenenko": {
        'Навчальна група': "КН-44",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [80, 90, 85, 97]
    },
    "Daria Darienko": {
        'Навчальна група': "КН-42",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [70, 75, 79, 80]
    },
    "Serhii Serhienko": {
        'Навчальна група': "КН-43",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [100, 98, 65, 73]
    },
    "Anastasia Anastasenko": {
        'Навчальна група': "КН-42",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [60, 70, 77, 67]
    },
    "Ivanna Ivvanenko": {
        'Навчальна група': "КН-44",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [80, 90, 85, 97]
    },
    "Ella Elloenko": {
        'Навчальна група': "КН-45",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [80, 80, 80, 80]
    },
    "Oleksandr Oleksandrenko": {
        'Навчальна група': "КН-41",
        'Предмети': ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон",
                     "Математичні методи дослідження операцій"],
        'Бали за семестр': [87, 92, 73, 79]
    }
}

groups_list = ["КН-41", "КН-42", "КН-43", "КН-44", "КН-45"]
disciplines_list = ["Чисельні методи", "Алгоритми та структури даних", "Програмування мовою Пайтон", "Математичні методи дослідження операцій"]

#функція додання студентів, автор Кондратенко Р. ППМР1-104
def add_students():
    print("\nВведіть дані студентів, яких дописуватимете.")
    print("Щоб завершити, напишіть 'стоп' при введенні імені студента.")

    while True:
        student_id = input("\nВведіть ім’я та прізвище студента: ")
        if student_id.lower() == "стоп":
            break

        group_input = input("Введіть свою навчальну групу (КН-41, КН-42, КН-43, КН-44, КН-45): ")
        if group_input not in groups_list:
            print("Такої навчальної групи не існує. Можливо, помилка при введенні.")
            continue

        disciplines_input = input("Введіть дисципліни, які виклпадались у цьому семестрі, через кому"
                                  "(для зручності просто скопіюйте (Чисельні методи, Алгоритми та структури даних, Програмування мовою Пайтон, Математичні методи дослідження операцій): ").split(", ")
        for disciplines in disciplines_input:
            if disciplines not in disciplines_list:
                print(f"Дисципліна '{disciplines}' не викладалась у цьому семестрі.")
                break
        else:
            marks_input = input(
                "Введіть оцінки з предметів, що викладались у цьому семестрі, записуючи їх через кому: ").split(", ")
            try:
                marks = list(map(int, marks_input))
            except ValueError:
                print("Оцінки мають бути цілими числами.")
                continue

            if len(marks) != len(disciplines_input):
                print("Кількість оцінок не співпадає з кількістю предметів, що викладались у семестрі. "
                      "Можлмво, ви недописали якийсь предмет чи забули виставити оцінку з якогось предмету, "
                      "або написали надлишкову кількість оцінок чи предмети, що не викладались у цьому семестрі.")
                continue
            students[student_id] = {
                    'Навчальна група': group_input,
                    'Предмети': disciplines_input,
                    'Бали за семестр': marks
                }
            print(f"Студента {student_id} додано до словника.")
#функція середнього арифметичного, автор Шевченко О. ППМР1-105
def calculate_group_average(data, target_group):
    if target_group not in groups_list:
        return f"Помилка: Група '{target_group}' не існує у системі."

    total_marks_sum = 0
    total_marks_count = 0

    for student_name, info in data.items():
        if info['Навчальна група'] == target_group:
            marks_list = info['Бали за семестр']
            total_marks_sum += sum(marks_list)
            total_marks_count += len(marks_list)

    if total_marks_count > 0:
        average = total_marks_sum / total_marks_count
        return f"Середній бал для групи {target_group}: {average:.2f}"
    else:
        return f"Студентів у групі {target_group} не знайдено."
#перемикач, автор Кондратенко Р. ППМР1-104, доповнюється іншими студентами при доданні нових функцій
choice = input("Введіть 1, щоб дописати студентів, 0 — щоб вивести дані, або 2 — щоб завершити: ")

if choice == "1":
    add_students()
    print("\nОновлений список студентів:")
    for name, info in students.items():
        print(f"\n {name}")
        print(f"   Група: {info['Навчальна група']}")
        print(f"   Предмети: {', '.join(info['Предмети'])}")
        print(f"   Оцінки: {', '.join(map(str, info['Бали за семестр']))}")

elif choice == "0":
    print("\nВиведення даних про кожного студента:")
    if not students:
        print("Студентів немає.")
    else:
        for name, info in students.items():
            print(f"\n {name}")
            print(f"   Група: {info['Навчальна група']}")
            print(f"   Предмети: {', '.join(info['Предмети'])}")
            print(f"   Оцінки: {', '.join(map(str, info['Бали за семестр']))}")

elif choice == "2":
    print("Завершення програми.")
elif choice == "4":
    group_to_check = input("\nВведіть назву групи, для якої потрібно обчислити середній бал: ")
    result = calculate_group_average(students, group_to_check)
    print(result)

else:

    print("Введено неіснуюче число, введіть ще раз, тільки ввівши або 0, або 1, або 2, або 4.")

